app/auth/authorize_api_request.rb

	def user
		# check if user is in the database
		# memorize user object
		@user ||= User.find(decoded_auth_token[:user_id]) if decoded_auth_token
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]